app/controllers/todo_items_controller.rb

  def create
      @todo_item = @todo_list.todo_items.create(todo_item_params)
---
INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "First Todo Item"], ["todo_list_id", 1], ["created_at", "2017-08-16 05:45:19.308708"], ["updated_at", "2017-08-16 05:45:19.308708"]]

  def destroy
    if @todo_item.destroy
---
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 2]]

  def complete
    @todo_item.update_attribute(:completed_at, Time.now)
---
UPDATE "todo_items" SET "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed_at", "2017-08-25 05:49:51.136856"], ["updated_at", "2017-08-25 05:49:51.137556"], ["id", 6]]